infoniten/FloatCore/platform/esp32/sdkconfig.defaults
# --- цель -------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32"

# --- flash 4 МБ (определено esptool на живой плате) -------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- таблица разделов -------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- частота тика: контур Refloat 500 Гц = 2 тика при 1000 Гц ---------------
CONFIG_FREERTOS_HZ=1000

# --- консоль ----------------------------------------------------------------
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- диагностика (ТЗ §14): panic печатает причину, регистры и backtrace ------
# и ОСТАНАВЛИВАЕТСЯ, а не перезагружается молча.
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=n
CONFIG_ESP_DEBUG_STUBS_ENABLE=n

# --- watchdog (ТЗ §11) ------------------------------------------------------
# TWDT включён, задачи контура подписаны явно. Panic не включаем: на v0.5
# срыв контура должен быть ВИДЕН в логе (backtrace зависшей задачи), а не
# спрятан за мгновенной перезагрузкой.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_INT_WDT=y

# --- контроль стека ---------------------------------------------------------
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_HEAP_POISONING_LIGHT=y

# --- радио выключено (ТЗ §18) ----------------------------------------------
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n

# --- ТЗ §23: производительность не оптимизируем до измерений ----------------
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
